/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "current": {
    "color_primary": "#000000",
    "color_secondary": "#333333",
    "color_accent": "#0070c9",
    "color_body_bg": "#ffffff",
    "color_body_text": "#333333",
    "color_headings": "#000000",
    "color_button_bg": "#000000",
    "color_button_text": "#ffffff",
    "font_heading": "helvetica_n4",
    "font_size_heading_base": 28,
    "font_body": "helvetica_n4",
    "font_size_body_base": 16,
    "sections": {
      "header": {
        "type": "header",
        "settings": {
          "logo": "",
          "menu": "main-menu"
        }
      },
      "footer": {
        "type": "footer",
        "blocks": {
          "footer-0": {
            "type": "text",
            "settings": {
              "title": "About Us",
              "text": "<p>Use this text to share information about your brand with your customers.</p>"
            }
          },
          "footer-1": {
            "type": "newsletter",
            "settings": {
              "title": "Subscribe to our newsletter"
            }
          },
          "footer-2": {
            "type": "link_list",
            "settings": {
              "title": "Quick links",
              "menu": "footer"
            }
          }
        },
        "block_order": [
          "footer-0",
          "footer-1",
          "footer-2"
        ],
        "settings": {
          "copyright_text": "All rights reserved.",
          "show_payment_icons": true
        }
      },
      "cart-template": {
        "type": "cart-template",
        "settings": {}
      },
      "hero-video": {
        "type": "hero-video",
        "settings": {
          "video_url": "https://cdn.shopify.com/videos/c/o/v/e2354af791eb4c9f98271a00d34dbdd7.mp4"
        }
      },
      "intro-text": {
        "type": "intro-text",
        "settings": {
          "text": "<p>GOD BLESS TORONTO COMMEMRATES THE 10 YEAR ANNIVERSARY OF Kid.</p>",
          "enable_hover_effect": true,
          "hover_image_width": 300
        }
      },
      "product-hero": {
        "type": "product-hero",
        "settings": {}
      },
      "product-specs": {
        "type": "product-specs",
        "settings": {
          "description": "<p>273 PP.<br>SOFTCOVER WITH TIP-IN IMAGE.<br>HARDCOVER LINEN SLIP CASE.<br>FOIL LETTERING.<br>EXPOSED SMYTH-SEWN SPINE.</p>"
        }
      },
      "product-grid": {
        "type": "product-grid",
        "settings": {
          "title": "Our Products",
          "collection": "",
          "products_limit": 4
        }
      },
      "gallery": {
        "type": "gallery",
        "settings": {
          "title": "Gallery"
        }
      },
      "publishing-credits": {
        "type": "publishing-credits",
        "settings": {
          "title": "Publishing Credits",
          "text": "<p>PUBLISHING CREDITS. Kid. Studio ©2025. Designed by Alex Doe. Produced by Jordan Smith. Editing by Taylor Lee. Featuring contributions from 30 contributors, including Chris Brown, Jamie Fox, Morgan Reed, Sam Carter, Riley Adams, Jordan Blake, Taylor Hill, Alex Kim, Cameron White, Avery Scott, Devon James, Drew Morgan, Casey Bennett, Logan West, Peyton Gray, Sydney Clark, Blake Harper, Jesse Lane, Dylan Fox, Quinn Brooks, Reese Parker, Skylar Collins, Corey Bell, Alex Rivera, Jamie Stone, Robin Myers, Cameron Dawson, Tyler Green, Hayden Fisher, and Riley Moore.</p><p>Website by <a href=\"https://left.systems\" target=\"_blank\">LEFT</a>.</p>"
        }
      },
      "policies": {
        "type": "policies",
        "settings": {
          "shipping_policy": "<p>SHIPPING & RETURNS. We ship worldwide from our studio. All orders are processed within 3-5 business days, excluding weekends and holidays. Once your order is shipped, you will receive a confirmation email with tracking information. Shipping Rates & Delivery Times. Domestic (within Canada): Standard shipping takes 3-7 business days. Expedited options available at checkout. International: Delivery times vary by location but typically take 7-21 business days. Customs processing may cause delays beyond our control. Duties & Taxes: International customers are responsible for any customs fees or duties incurred upon delivery. We are not responsible for lost, stolen, or delayed packages once they are in the carrier’s possession. Please contact the shipping provider for any delivery concerns. RETURNS & EXCHANGES. We accept returns and exchanges within 14 days of delivery for items in unworn, original condition with all tags attached. To initiate a return, email info@kidstudio.co with your order number and reason for return. Wait for confirmation and return instructions. Ship the item back to us at your expense. We recommend using a trackable service. Once received and inspected, refunds will be processed to the original payment method within 5-7 business days. Shipping fees are non-refundable.</p>",
          "privacy_policy": "<p>PRIVACY POLICY. At Kid. Studio, we value your privacy and are committed to protecting your personal data. This policy outlines how we collect, use, and safeguard your information when you visit our website. INFORMATION WE COLLECT. Personal Information. Name, email, shipping/billing address, phone number, and payment details. Automatically Collected Data. IP address, browser type, and site usage analytics. Cookies & Tracking Technologies. We use cookies to enhance user experience and improve our services. How We Use Our Information. We use your data to: Process and fulfill orders. Communicate updates about your purchase. Improve our website and services Prevent fraud and secure transactions. We do not sell or share your personal data with third parties for marketing purposes. DATA SECURITY. We implement industry-standard security measures to protect your information. However, no online transmission is 100% secure, so please shop with confidence but remain mindful. YOUR RIGHTS. You may request access, corrections, or deletion of your data by contacting us at info@kidstudio.co. You can also opt out of marketing emails at any time. CONTACT US. For any questions regarding shipping, returns, or privacy, reach out to info@kidstudio.co.</p>"
        }
      }
    },
    "content_for_index": []
  }
}
